This PR contains the Terraform plan for `preprod` workspace.
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket.bucket will be destroyed
  # (because aws_s3_bucket.bucket is not in configuration)
  - resource "aws_s3_bucket" "bucket" {
      - arn                         = "arn:aws:s3:::tf-bucket-20240820-0908" -> null
      - bucket                      = "tf-bucket-20240820-0908" -> null
      - bucket_domain_name          = "tf-bucket-20240820-0908.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "tf-bucket-20240820-0908.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "tf-bucket-20240820-0908" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "950bf6f94d43890e4ad3eae952d3eaf736099ac13fcb9791bb21836ac8b528b0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.github_oidc_role.data.aws_iam_policy_document.oidc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:avoajaugochukwu/*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.github_oidc_role.aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_oidc_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_oidc_role-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.github_oidc_role.aws_iam_role_policy_attachment.attach-deploy will be created
  + resource "aws_iam_role_policy_attachment" "attach-deploy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser"
      + role       = "github_oidc_role-role"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - bucket_arn  = "arn:aws:s3:::tf-bucket-20240820-0908" -> null
  - bucket_name = "tf-bucket-20240820-0908" -> null
```